modules/OpenQBMM/tutorials/diluteVdfTransportFoam/rotatingCylinder/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel velocity;

velocityCoeffs
{
    odeCoeffs
    {
        solveOde on;
        ATol    1.0e-4;
        RTol    1.0e-3;
        fac     0.9;
        facMin  0.1;
        facMax  5.0;
        minLocalDt 1.0e-4;
    }

    collision  on;

    collisionKernel
    {
        collisionKernel esBGK;
        implicit    on;
        e           0.9;
//         d           100e-6;
//         rho         2500;
    }
}

// ************************************************************************* //
